<?php

use yii\db\Migration;

/**
 * Class m191008_062809_fix_stock
 */
class m191008_062809_fix_stock extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->execute("INSERT INTO `stock` (`id`, `id_branch`, `name`, `date_create`, `date_update`) VALUES
(2, 1, 'Казань', '2019-08-18 08:54:43', '2019-08-19 20:30:19'),
(3, 4, 'Екатеринбург', '2019-08-18 09:01:06', '2019-08-18 09:01:06'),
(4, 3, 'Самара', '2019-09-14 12:07:02', '2019-09-14 12:07:02'),
(5, 5, 'Ижевск', '2019-09-14 12:07:12', '2019-09-14 12:07:12'),
(6, 6, 'Ростов-на-Дону', '2019-09-14 12:07:29', '2019-09-14 12:07:29'),
(7, 7, 'Тверь', '2019-09-14 12:07:40', '2019-09-14 12:07:40'),
(8, 8, 'Липецк', '2019-09-14 12:07:50', '2019-09-14 12:07:50'),
(9, 9, 'Пермь', '2019-09-14 12:07:59', '2019-09-14 12:07:59'),
(10, 10, 'Пенза', '2019-09-14 12:08:13', '2019-09-14 12:08:13'),
(11, 11, 'Рязань', '2019-09-14 12:08:30', '2019-09-14 12:08:30'),
(12, 12, 'Тольятти', '2019-09-14 12:08:41', '2019-09-14 12:08:41'),
(13, 12, 'Ульяновск', '2019-09-14 12:08:58', '2019-09-14 12:08:58'),
(14, 14, 'Иваново', '2019-09-14 12:09:10', '2019-09-14 12:09:10'),
(15, 15, 'Ярославль', '2019-09-14 12:09:20', '2019-09-14 12:09:20'),
(16, 16, 'Тула', '2019-09-14 12:09:31', '2019-09-14 12:09:31'),
(17, 17, 'Смоленск', '2019-09-14 12:09:44', '2019-09-14 12:09:44');");
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        echo "m191008_062809_fix_stock cannot be reverted.\n";

        return false;
    }

    /*
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

    }

    public function down()
    {
        echo "m191008_062809_fix_stock cannot be reverted.\n";

        return false;
    }
    */
}
